---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TransformWithBoundary
source: html/935ecb46-cbb3-058c-d70d-cd6c95ef432a.htm
---
# TransformWithBoundary Members

Constructs a new copy of the input TransformWithBoundary object.